export const state = () => ({
  countries: [
    {
      id: 1,
      name: 'Мальдивы',
      subTitle: 'Идиллический рай среди бирюзовых вод и белоснежных пляжей',
      description: 'Мальдивы – это сокровище, спрятанное в бирюзовых водах Индийского океана. Этот архипелаг из 26 атоллов предлагает непревзойденную красоту песчаных пляжей, изумительные коралловые рифы и безграничную роскошь.',
      backgroundImage: 'maldives.png'
    },
    {
      id: 2,
      name: 'Бали',
      subTitle: 'Остров приключений пляжного рая и духовной гармонии',
      description: 'Бали – магический остров, полный невероятных приключений и удивительных впечатлений. Это райское место, где сливаются воедино живописные пляжи, древние храмы, пышная природа и уникальная культура.',
      backgroundImage: 'bali.png'
    },
    {
      id: 3,
      name: 'Сейшелы',
      subTitle: 'Безмятежный рай на земле белоснежные пляжи и уникальная природа',
      description: 'Сейшелы – утопический рай в сердце Индийского океана, где встречаются белоснежные песчаные пляжи, бирюзовые лагуны и захватывающая природа. Этот архипелаг из 115 островов является истинным воплощением роскоши, спокойствия и экзотики.',
      backgroundImage: 'sesheli.png'
    },
    {
      id: 4,
      name: 'Маврикий',
      subTitle: 'История, природа и роскошь острова',
      description: 'Маврикий – жемчужина Индийского океана, где сливаются воедино бескрайние белоснежные пляжи, лазурные воды и захватывающая природа.',
      backgroundImage: 'mavrikiy.png'
    },
    {
      id: 5,
      name: 'Шри Ланка',
      subTitle: 'Откройте двери в экзотическое путешествие',
      description: 'Добро пожаловать на остров Шри Ланка, где вас ожидает уникальное путешествие в мир экзотики и приключений!',
      backgroundImage: 'sesheli.png'
    },
    {
      id: 6,
      name: 'Занзибар',
      subTitle: 'Островные просторы и атмосфера приключений!',
      description: 'Добро пожаловать на Занзибар, уникальный архипелаг, где распахиваются величественные просторы океана, а атмосфера наполнена экзотикой и приключениями!',
      backgroundImage: 'mavrikiy.png'
    },
    {
      id: 7,
      name: 'Дубай',
      subTitle: 'Откройте для себя гламур и роскошь Дубая: Жемчужина пустыни',
      description: 'Мальдивы – это сокровище, спрятанное в бирюзовых водах Индийского океана. Этот архипелаг из 26 атоллов предлагает непревзойденную красоту песчаных пляжей, изумительные коралловые рифы и безграничную роскошь.',
      backgroundImage: 'sesheli.png'
    },
    {
      id: 8,
      name: 'Турция',
      subTitle: 'Волшебство на стыке двух компонентов',
      description: 'Добро пожаловать в Турцию, место, где восток встречается с западом, и история сливается с современностью!',
      backgroundImage: 'turciya.png'
    },
    {
      id: 9,
      name: 'Египет',
      subTitle: 'Земля фараонов, солнечные пляжи и загодочная культура',
      description: 'Египет – загадочная страна древних фараонов, непревзойденной красоты пустынь и величественных пирамид. Это место, где история и современность сливаются воедино, создавая неповторимую атмосферу и удивительный опыт для путешественников.',
      backgroundImage: 'egipet.png'
    },
    {
      id: 10,
      name: 'Филиппины',
      subTitle: 'Исследуйте вошбество Филиппин: Ваши ключи к райскому приключению',
      description: 'Добро пожаловать на волшебные Филиппины, где природа, культура и гостеприимство сливаются в неповторимое путешествие!',
      backgroundImage: 'turciya.png'
    },
  ]
})
export const mutations = {
}

export const getters = {
}
export const actions = {
}
